eisup_2019_docmng_integration/src/Documents/Абс_АктПриёмкиВыполненныхРабот/Абс_АктПриёмкиВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Абс_АктПриёмкиВыполненныхРабот</name>
  <basedOn>Document.ДоговорНаВыполнениеРаботСФизЛицом</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыАктовПриемки</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СтатусИСУЗК</name>
    <type>
      <types>EnumRef.абс_СтатусыКадровоРасчетныхДокументов</types>
      <types>EnumRef.абс_СтатусыРасчетныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПлатежныйДокумент</name>
    <type>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.абс_СчетНаОплату</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.СотрудникиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорПодряда</name>
      <type>
        <types>DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗаРаботу</name>
      <comment>Сумма в валюте документа</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>абс_СодержаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>абс_ДатаНачалаПериодаДляУчетаСтажа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>абс_ДатаОкончанияПериодаДляУчетаСтажа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтражениеРасходаПоАналитике</name>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИзменениеСтатусовАктовПриёмки/абс_ИзменениеСтатусовАктовПриёмки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИзменениеСтатусовАктовПриёмки</name>
  <comment>18259</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <dimensions>
    <name>АктПриёмкиВыполненныхРабот</name>
    <type>
      <types>DocumentRef.Абс_АктПриёмкиВыполненныхРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусАкта</name>
    <type>
      <types>EnumRef.абс_СтатусыАктовПриемки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыАктовПриемки/абс_СтатусыАктовПриемки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыАктовПриемки</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОФК</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаБухгалтером</name>
  </enumValues>
  <enumValues>
    <name>ДокументыПринятыБухгалтером</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>УточнениеОФК</name>
  </enumValues>
  <enumValues>
    <name>УточнениеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаДокумента</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемЦФО</name>
  </enumValues>
  <enumValues>
    <name>Начислено</name>
  </enumValues>
  <enumValues>
    <name>НаОплату</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыДоговоровПодряда/абс_СтатусыДоговоровПодряда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыДоговоровПодряда</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>ПодписаниеВторойСтороны</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителяЦФО</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаЭБ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеГлавнымБухгалтером</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеКадрами</name>
  </enumValues>
  <enumValues>
    <name>Подписание</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияСотрудника</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияНомераДоговора</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаПД</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеОтделомКадров</name>
  </enumValues>
  <enumValues>
    <name>СменаОтветственного</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ХарактерВыплатыПоДоговору/ХарактерВыплатыПоДоговору.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХарактерВыплатыПоДоговору</name>
  <enumValues>
    <name>ОднократноВКонцеСрока</name>
  </enumValues>
  <enumValues>
    <name>Ежемесячно</name>
  </enumValues>
  <enumValues>
    <name>абс_ПоАктамВыполненныхРабот</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/ХранилищеДополнительнойИнформации/ХранилищеДополнительнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищеДополнительнойИнформации</name>
  <comment>Хранилище дополнительной информации</comment>
  <attributes>
    <name>ВидДанных</name>
    <comment>Вид данных</comment>
    <type>
      <types>EnumRef.ВидыДополнительнойИнформацииОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <comment>Имя файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <comment>Объект</comment>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам</types>
      <types>CatalogRef.СерииНоменклатуры</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.абс_ЗадачаВТехподдержку</types>
      <types>CatalogRef.Территории</types>
      <types>DocumentRef.ВнутреннееПеремещениеСредствПриБюджетировании</types>
      <types>DocumentRef.абс_ЗадачаТЭО</types>
      <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      <types>DocumentRef.абс_ПоступлениеУниверсальныйСклад</types>
      <types>DocumentRef.абс_РазукрупнениеОС</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>DocumentRef.ТребованиеНакладная</types>
      <types>CatalogRef.абс_ТЭО</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>DocumentRef.абс_РаспределяемыеДоходыРасходы</types>
      <types>DocumentRef.абс_ПеремещениеУниверсальныйСклад</types>
      <types>CatalogRef.ЗаявкиКандидатов</types>
      <types>DocumentRef.абс_РезервыПроизведенныхРасходов</types>
      <types>CatalogRef.ОсновныеСредства</types>
      <types>DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</types>
      <types>DocumentRef.абс_НеотфактурованнаяПоставка</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ПередачаТоваров</types>
      <types>DocumentRef.абс_РаспоряжениеНаЗакупку</types>
      <types>DocumentRef.абс_ИзменениеКонтрагентаВДоговоре</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.абс_ПлановыеРегламентныеРаботы</types>
      <types>DocumentRef.ПеремещениеМатериаловВЭксплуатации</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>CatalogRef.Помещения</types>
      <types>DocumentRef.ttk_РаспоряжениеНаЗакупку</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.СписаниеМатериаловИзЭксплуатации</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
      <types>DocumentRef.ВозвратПереданныхТоваров</types>
      <types>DocumentRef.ПередачаМатериаловВЭксплуатацию</types>
      <types>DocumentRef.абс_ЗакупочныйЗаказ</types>
      <types>DocumentRef.абс_ЧастичнаяЛиквидацияОС</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.абс_РеклассификацияБюджета</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>CatalogRef.Контрагенты</types>
      <types>DocumentRef.ttk_ПроектКорректировкиДога</types>
      <types>CatalogRef.РасходыБудущихПериодов</types>
      <types>DocumentRef.абс_ЗаявкаНаДобавлениеИзменениеПрав</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>CatalogRef.Организации</types>
      <types>DocumentRef.абс_ГрупповаяРеклассификацияБюджета</types>
      <types>DocumentRef.абс_ВводЗначенийПоказателейДляРасчетаКПЭ</types>
      <types>DocumentRef.Событие</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>CatalogRef.КомпетенцииРаботников</types>
      <types>DocumentRef.абс_ПереносДанных</types>
      <types>DocumentRef.абс_СчетНаОплату</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.ЭлектронноеПисьмо</types>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
      <types>CatalogRef.Вакансии</types>
      <types>DocumentRef.абс_АВИЗО</types>
      <types>CatalogRef.абс_ИнструкцииПользователя</types>
      <types>DocumentRef.Абс_АктПриёмкиВыполненныхРабот</types>
      <types>BusinessProcessRef.абсЗаявкаВПоддержку</types>
      <types>CatalogRef.Номенклатура</types>
      <types>DocumentRef.абс_ВыбытиеУниверсальныйСклад</types>
      <types>DocumentRef.ПеремещениеОС</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.АктСверкиВзаиморасчетов</types>
      <types>DocumentRef.абс_ЗаявкаНаПроект</types>
      <types>DocumentRef.ПланируемоеПоступлениеДенежныхСредств</types>
      <types>DocumentRef.абс_ВводБюджета</types>
      <types>DocumentRef.БюджетнаяОперация</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.ПолучениеУслугПоПереработке</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <comment>Хранилище</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаПрикрепленияФайла</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИтоговыйФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИнициаторФайла</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КлючСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЭтоСчетСканСчетаНаОплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЗагруженИзИСУЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СвойствоОС</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.абс_СвойстваОС</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипДокумента</name>
    <type>
      <types>CatalogRef.абс_ТипыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ttk_ХэшФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ttk_СсылкаНаАналогичныйФайл</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Documents/Абс_АктПриёмкиВыполненныхРабот/ObjectModule.bsl
// АБС ВСТАВКА Согласование первичных документов

Перем мЗаполнениеНеУспешно Экспорт;
Перем мТекущийПользователь;
Перем ПериодСтатуса;

Процедура ЗаписатьНовыйСтатус(НовыйСтатус, Комментарий = Неопределено) Экспорт
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	
	НаборЗаписей = РегистрыСведений.абс_ИзменениеСтатусовАктовПриёмки.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.АктПриёмкиВыполненныхРабот.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = абс_СерверныеФункции.ПолучитьДатуСервера();
	ПериодСтатуса = Запись.Период;

	Запись.АктПриёмкиВыполненныхРабот = Ссылка;
	Запись.Исполнитель 			  	  = ТекПользователь;	
	Запись.СтатусАкта				  = НовыйСтатус;
		
	Запись.Комментарий 				  = Комментарий;
	
	ОтветственныйСотрудник = абс_БизнесПроцессы.ПолучитьСотрудникаПользователя(ТекПользователь);
	
	Если НЕ ОтветственныйСотрудник = Неопределено Тогда
		//Запись.ДолжностьОтветственного	= ОтветственныйСотрудник.Должность;
		Запись.Сотрудник				= ОтветственныйСотрудник;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция НайтиБПСогласование() Экспорт
	
	//Возврат абс_БизнесПроцессы.НайтиБизнесПроцессПоПервичномуДокументу(Ссылка, "абс_СогласованиеАктовПриемки");	
	
	ИмяБизнесПроцесса = "абс_СогласованиеАктовПриемки";
	БП = Неопределено;
	
	ЗапросБП = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                        |	абсБП.Ссылка
	                        |ИЗ
	                        |	БизнесПроцесс." + ИмяБизнесПроцесса + " КАК абсБП
	                        |ГДЕ
	                        |	абсБП.ПервичныйДокумент = &ПервичныйДокумент И
							|	абсБП.Завершен = ЛОЖЬ
	                        |
	                        |УПОРЯДОЧИТЬ ПО
	                        |	абсБП.Дата УБЫВ");
							
	ЗапросБП.УстановитьПараметр("ПервичныйДокумент", Ссылка);
	
	ВыборкаБП = ЗапросБП.Выполнить().Выбрать();
	
	Если ВыборкаБП.Следующий() Тогда
		БП = ВыборкаБП.Ссылка;
	КонецЕсли;
	
	Возврат БП;

	
КонецФункции

Функция ПолучитьЗадачуПоПервичномуДокументуСогласование() Экспорт
	
	БП = НайтиБПСогласование();
	
	Если БП = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СпТочек = Новый Массив;
	
	Статус = абс_Статус;
	
	Если Статус = Перечисления.абс_СтатусыАктовПриемки.Подготовка Тогда
		
		//СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеАктовПриемки.ТочкиМаршрута.ДействиеУточнениеОФК);
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеАктовПриемки.ТочкиМаршрута.ДействиеУточнениеБухгалтером);
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеАктовПриемки.ТочкиМаршрута.ДействиеОтказ);
		
	//ИначеЕсли Статус = Перечисления.абс_СтатусыАктовПриемки.СогласованиеОФК Тогда

	//	СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеАктовПриемки.ТочкиМаршрута.ДействиеСогласованиеРуководителемЦФО);	
		
	//ИначеЕсли Статус = Перечисления.абс_СтатусыАктовПриемки.УточнениеОФК Тогда

	//	СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеАктовПриемки.ТочкиМаршрута.ДействиеСогласованиеОФК);
		
	ИначеЕсли Статус = Перечисления.абс_СтатусыАктовПриемки.УточнениеБухгалтерией Тогда

		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеАктовПриемки.ТочкиМаршрута.ДействиеОбработкаПринятыхДокументов);
				
	ИначеЕсли Статус = Перечисления.абс_СтатусыАктовПриемки.Отказ Тогда		
		
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеАктовПриемки.ТочкиМаршрута.ДействиеОбработкаБухгалтерией);
		//СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеАктовПриемки.ТочкиМаршрута.ДействиеСогласованиеОФК);
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеАктовПриемки.ТочкиМаршрута.ДействиеОбработкаПринятыхДокументов);
		
	ИначеЕсли Статус = Перечисления.абс_СтатусыАктовПриемки.Завершен Тогда
		
		//СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеАктовПриемки.ТочкиМаршрута.ДействиеОбработкаБухгалтерией);
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеАктовПриемки.ТочкиМаршрута.ДействиеОбработкаПринятыхДокументов);
				
	ИначеЕсли Статус = Перечисления.абс_СтатусыАктовПриемки.ОбработкаБухгалтером Тогда
		
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеАктовПриемки.ТочкиМаршрута.ДействиеСогласованиеРуководителемЦФО);	
		
	ИначеЕсли Статус = Перечисления.абс_СтатусыАктовПриемки.ДокументыПринятыБухгалтером Тогда
		
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеАктовПриемки.ТочкиМаршрута.ДействиеОбработкаБухгалтерией);
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеАктовПриемки.ТочкиМаршрута.ДействиеУточнениеБухгалтером);
		
	//ИначеЕсли Статус = Перечисления.абс_СтатусыАктовПриемки.СогласованиеОФК Тогда
	//	
	//	СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеАктовПриемки.ТочкиМаршрута.ДействиеУточнениеОФК);
	//	СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеАктовПриемки.ТочкиМаршрута.ДействиеУточнениеБухгалтером);		
		
	КонецЕсли;
			
	Возврат абс_БизнесПроцессы.НайтиЗадачуЗЗ(БП, СпТочек ,, Ложь);

КонецФункции

Функция ПолучитьРежимЗаписиДокумента() Экспорт
	
	РежимЗаписи = Неопределено;
	
	Если 	абс_Статус = Перечисления.абс_СтатусыАктовПриемки.Подготовка
		ИЛИ абс_Статус = Перечисления.абс_СтатусыАктовПриемки.Отмена Тогда 
			
		Если Проведен Тогда
			
			РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
		Иначе
			
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		
	Иначе
		
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
		
	КонецЕсли;
	
	Возврат РежимЗаписи;
	
КонецФункции
// АБС ВСТАВКА Согласование первичных документов КОНЕЦ


Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	ОбщегоНазначения.ДобавитьПрефиксОрганизации(ЭтотОбъект, Префикс);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	//АБС Шамов 33159
	//Если Ссылка.Пустая() И Сотрудники.Количество()>0 ТОгда
	Если Сотрудники.Количество()>0 ТОгда  //АБС Чалавиев 25.12.2013 000020073
		СтрокаТЧ = Сотрудники[0];
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.абс_ДатаНачалаПериодаДляУчетаСтажа)
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.абс_ДатаОкончанияПериодаДляУчетаСтажа) ТОгда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнена дата начала или дата окончания работ!", Отказ);
		КонецЕсли;
	КонецЕсли;
	//\\АБС Шамов 33159
        	
	Если ПустаяСтрока(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	СуммаДокумента = Сотрудники.Итог("СуммаЗаРаботу");
	//Заявка 000020081
	МассивТЧ = Новый Массив();
	МассивТЧ.Добавить(Сотрудники);
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(МассивТЧ);
	//
	
	//абс_БизнесПроцессы.УстановитьСтатусИСУЗКДляАктаПриёмки(ЭтотОбъект);
КонецПроцедуры

// Согласование актов
//Процедура ЗаписатьНовыйСтатус(НовыйСтатус, Комментарий = Неопределено) Экспорт
//	
//	НаборЗаписей = РегистрыСведений.абс_ИзменениеСтатусовАктовПриёмки.СоздатьНаборЗаписей();
//	НаборЗаписей.Отбор.АктПриёмкиВыполненныхРабот.Установить(Ссылка);
//	НаборЗаписей.Прочитать();
//	
//	Запись = НаборЗаписей.Добавить();
//	Запись.Период = абс_СерверныеФункции.ПолучитьДатуСервера();
//	Запись.АктПриёмкиВыполненныхРабот	= Ссылка;
//	Запись.Исполнитель	 				= глЗначениеПеременной("глТекущийПользователь");	
//	Запись.СтатусАкта					= НовыйСтатус;
//	Запись.Комментарий 					= Комментарий;
//	
//	НаборЗаписей.Записать();
//	
//КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Если обмен данными не делаем проверок
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// АБС ВСТАВКА
	Если абс_Статус = Перечисления.абс_СтатусыАктовПриемки.СогласованиеРуководителемЦФО Тогда
		
		Если Сотрудники.Количество() > 0 Тогда
			
			Если Не ЗначениеЗаполнено(Сотрудники[0].ДоговорПодряда) Тогда
				Сообщить("Не указан договор");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Сотрудники[0].Сотрудник) Тогда
				Сообщить("Не указан сотрудник");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
			Если Сотрудники[0].СуммаЗаРаботу = 0 Тогда
				Сообщить("Не указана сумма акта");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
			Если Сотрудники[0].СуммаЗаРаботу > Сотрудники[0].ДоговорПодряда.СуммаЗаРаботу Тогда
				Сообщить("Сумма акта превышает сумму договора");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		// Проверка наличия файлов
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ХранилищеДополнительнойИнформации.ИмяФайла КАК Наименование,
		|	ХранилищеДополнительнойИнформации.Ссылка
		|ИЗ
		|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
		|ГДЕ
		|	ХранилищеДополнительнойИнформации.Объект = &Объект
		|	И ХранилищеДополнительнойИнформации.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительнойИнформацииОбъектов.Файл)
		|	И ХранилищеДополнительнойИнформации.ПометкаУдаления = ЛОЖЬ");
		
		Запрос.УстановитьПараметр("Объект", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Сообщить("К акту не прикреплен ни один файл. Движение по статусам дальше невозможно.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
		
	КонецЕсли; 
	// АБС ВСТАВКА КОНЕЦ
	
	// АБС ВСТАВКА Согласование первичных документов
	СтатусПоРегистру = абс_БизнесПроцессы.ПолучитьСтатусАктаПриёмкиПоРегистру(Ссылка);
	//АБС ВСТАВКА №40078 НАЧАЛО «25 апреля 2014 г.», Пополитов
	ДаннаяБазаНеКопия = абс_СерверныеФункции.абс_ДаннаяБазаНеКопия();
	Если не ДаннаяБазаНеКопия Тогда
		ЗаписатьНовыйСтатус(абс_Статус, абс_ПричинаИзмененияСтатуса);	
	КонецЕсли;	
	//\\АБС ВСТАВКА №40078 КОНЕЦ		
	
	Если ДаннаяБазаНеКопия и (не абс_Статус = СтатусПоРегистру) Тогда
		ЗаписатьНовыйСтатус(абс_Статус, абс_ПричинаИзмененияСтатуса);
		
		// АБС ВСТАВКА ИНТЕГРАЦИЯ С ИСУЗК
		//Если ЗначениеЗаполнено(СтатусПоРегистру) Тогда
		
		// Создаем акт в ИСУЗК
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Абс_АктПриёмкиВыполненныхРабот.Номер,
		|	Абс_АктПриёмкиВыполненныхРабот.Дата,
		|	Абс_АктПриёмкиВыполненныхРабот.Организация.Код КАК Организация,
		|	Абс_АктПриёмкиВыполненныхРабот.Комментарий,
		|	Абс_АктПриёмкиВыполненныхРабот.ПодразделениеОрганизации.абс_КодИСУЗК КАК ПодразделениеОрганизации,
		|	Абс_АктПриёмкиВыполненныхРабот.МесяцНачисления,
		|	Абс_АктПриёмкиВыполненныхРабот.СуммаДокумента,
		|	Абс_АктПриёмкиВыполненныхРабот.абс_Статус КАК Статус,
		// нач закоммент Нарыжный 14.11.2013 35133
		//|	Абс_АктПриёмкиВыполненныхРаботСотрудники.Сотрудник.абс_КодИСУЗК КАК Сотрудник,
		// кон закоммент Нарыжный 14.11.2013 35133
		// нач ВСТАВКА Нарыжный 14.11.2013 35133
		|	Абс_АктПриёмкиВыполненныхРаботСотрудники.Сотрудник.абс_УникальныйИдентификаторСотрудника КАК Сотрудник,
		// кон ВСТАВКА Нарыжный 14.11.2013 35133
		|	Абс_АктПриёмкиВыполненныхРаботСотрудники.ДоговорПодряда.Номер,
		|	Абс_АктПриёмкиВыполненныхРаботСотрудники.ДоговорПодряда.Дата,
		|	Абс_АктПриёмкиВыполненныхРаботСотрудники.СуммаЗаРаботу,
		|	Абс_АктПриёмкиВыполненныхРаботСотрудники.абс_СодержаниеРабот КАК СодержаниеРабот,
		//АБС Шамов 33159 Вставка Начало				
		|	Абс_АктПриёмкиВыполненныхРаботСотрудники.абс_ДатаНачалаПериодаДляУчетаСтажа КАК ДатаНачалаПериодаДляУчетаСтажа,
		|	Абс_АктПриёмкиВыполненныхРаботСотрудники.абс_ДатаОкончанияПериодаДляУчетаСтажа КАК ДатаОкончанияПериодаДляУчетаСтажа,
		//\\АБС Шамов 33159 Вставка Конец
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК СтатусСтрока,
		|	Абс_АктПриёмкиВыполненныхРабот.Ответственный.Наименование КАК Ответственный,
		|	Абс_АктПриёмкиВыполненныхРабот.абс_ПричинаИзмененияСтатуса КАК ПричинаИзмененияСтатуса,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК СотрудникИзменившийСтатус,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодСтатуса,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК ПользовательИзменившийСтатус
		|ИЗ
		|	Документ.Абс_АктПриёмкиВыполненныхРабот КАК Абс_АктПриёмкиВыполненныхРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Абс_АктПриёмкиВыполненныхРабот.Сотрудники КАК Абс_АктПриёмкиВыполненныхРаботСотрудники
		|		ПО (Абс_АктПриёмкиВыполненныхРаботСотрудники.Ссылка = Абс_АктПриёмкиВыполненныхРабот.Ссылка)
		|ГДЕ
		|	Абс_АктПриёмкиВыполненныхРабот.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Результат = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Строка Из Результат Цикл
			
			Строка.СтатусСтрока = Строка(Строка.Статус);
			Строка.СотрудникИзменившийСтатус = мТекущийПользователь.абс_Сотрудник.абс_КодИСУЗК;
			Строка.ПериодСтатуса = ПериодСтатуса;
			Строка.ПользовательИзменившийСтатус = мТекущийПользователь.Наименование; 
			
		КонецЦикла;
		
		Результат.Колонки.Добавить("ОтражениеРасходаПоАналитике");
		ОРвА=Новый Структура;
		Для каждого йСтр Из ЭтотОбъект.ОтражениеРасходаПоАналитике Цикл
			йСтрока=Новый Массив;
			Попытка
				йСтрока.Добавить(йСтр.Субконто1.Код);
			Исключение
				йСтрока.Добавить(Строка(йСтр.Субконто1));
			КонецПопытки;
			Попытка
				йСтрока.Добавить(йСтр.Субконто2.Код);
			Исключение
				йСтрока.Добавить(Строка(йСтр.Субконто2));
			КонецПопытки;
			Попытка
				йСтрока.Добавить(йСтр.Субконто3.Код);
			Исключение
				йСтрока.Добавить(Строка(йСтр.Субконто3));
			КонецПопытки;
			йСтрока.Добавить(йСтр.Сумма);
			ОРвА.Вставить("Строка"+йСтр.НомерСтроки,йСтрока);
		КонецЦикла;
		Результат[0].ОтражениеРасходаПоАналитике=ЗначениеВСтрокуВнутр(ОРвА);
		//АБС Шамов 33159 Замена Начало				
		//ТаблицаДляВыгрузки = Результат.Скопировать(, "Номер, Дата, Организация, Комментарий, ПодразделениеОрганизации, МесяцНачисления, 
		//	| СуммаДокумента, Сотрудник, ДоговорПодрядаНомер, ДоговорПодрядаДата, СуммаЗаРаботу, СодержаниеРабот,   
		//	| СтатусСтрока, Ответственный, СотрудникИзменившийСтатус, ПричинаИзмененияСтатуса, ПериодСтатуса, ПользовательИзменившийСтатус");				
		ТаблицаДляВыгрузки = Результат.Скопировать(, "Номер, Дата, Организация, Комментарий, ПодразделениеОрганизации, МесяцНачисления, 
		| СуммаДокумента, Сотрудник, ДоговорПодрядаНомер, ДоговорПодрядаДата, СуммаЗаРаботу, СодержаниеРабот, ДатаНачалаПериодаДляУчетаСтажа, ДатаОкончанияПериодаДляУчетаСтажа,
		| СтатусСтрока, Ответственный, СотрудникИзменившийСтатус, ПричинаИзмененияСтатуса, ПериодСтатуса, ПользовательИзменившийСтатус, ОтражениеРасходаПоАналитике");				
		//\\АБС Шамов 33159 Замена Конец
		
		//Сообщить(ЗначениеВСтрокуВнутр(ТаблицаДляВыгрузки));
		
		СообщениеОбОшибке = "";
		ДокументСозданВИСУЗК = Ложь;
		Попытка
			ДокументСозданВИСУЗК = абс_WebServiceСервер.ИнициализацияDogovor_Act_Integration_Act(Номер, Дата, ЗначениеВСтрокуВнутр(ТаблицаДляВыгрузки), СообщениеОбОшибке);
		Исключение	
			Сообщить(СообщениеОбОшибке);
			Сообщить("Не удалось создать документ в базе ИСУЗК!");
			//СообщениеОбОшибке = "";
			//Отказ = Истина;
			//Возврат;
		КонецПопытки;
		Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
			Сообщить(СообщениеОбОшибке);
			Сообщить("Не удалось создать документ в базе ИСУЗК!");
			//Отказ = Истина;
			//Возврат;
		КонецЕсли;	
		Если Не ДокументСозданВИСУЗК Тогда
			Сообщить("Не удалось создать документ в базе ИСУЗК!");
			//Отказ = Истина;
			//Возврат;
		Иначе
			Сообщить("Документ создан в базе ИСУЗК");
		КонецЕсли;
		
		//КонецЕсли; 			
		// АБС ВСТАВКА КОНЕЦ 
	КонецЕсли;
	
	// АБС Изменение Родин Отключение бизнес-процессов 110314
	СогласованиеБезБП = глЗначениеПеременной("абс_СогласованиеБезБП");
	Если Не СогласованиеБезБП Тогда
		ВыполнитьЗадачиПоБП(Отказ);
	КонецЕсли;
	// АБС Изменение Родин Отключение бизнес-процессов 110314
	
	//АБС ВСТАВКА №40078 НАЧАЛО «25 апреля 2014 г.», Пополитов
	Если не абс_СерверныеФункции.абс_ДаннаяБазаНеКопия() Тогда
		Возврат;	
	КонецЕсли;	
	//\\АБС ВСТАВКА №40078 КОНЕЦ	
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ХранилищеДополнительнойИнформации.ИмяФайла КАК Наименование,
	|	ХранилищеДополнительнойИнформации.Ссылка
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.Объект = &Объект
	|	И ХранилищеДополнительнойИнформации.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительнойИнформацииОбъектов.Файл)
	|	И ХранилищеДополнительнойИнформации.ПометкаУдаления = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("Объект", Ссылка);
	
	ТЗФайлов = Запрос.Выполнить().Выгрузить();
	
	СписокФайлов = Новый Соответствие;
	Для Каждого ТекФайл Из ТЗФайлов Цикл
		ТекФайл = Новый Структура("Ссылка, Наименование", ТекФайл.Ссылка, ТекФайл.Ссылка.Наименование);
		СписокФайлов.Вставить(ТекФайл.Ссылка, ТекФайл);
	КонецЦикла;
	
	СообщениеОбОшибке = "";
	Попытка
		Результат = абс_WebServiceСервер.ИнициализацияDogovor_PersonData_PutFile(СписокФайлов, Ссылка, СообщениеОбОшибке, "Акт");
	Исключение
		Сообщить(СообщениеОбОшибке);
		СообщениеОбОшибке = "";
		//Отказ = Истина;
		//Возврат;
	КонецПопытки;
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		Сообщить(СообщениеОбОшибке);
	КонецЕсли;
	
	//Для Каждого СтрокаТЗ Из ТЗФайлов Цикл
	//	ФайлОбъект = СтрокаТЗ.Ссылка.ПолучитьОбъект();
	//	Попытка
	//		ФайлОбъект.Удалить();
	//	Исключение
	//	КонецПопытки;
	//КонецЦикла; 
	
КонецПроцедуры

Процедура ВыполнитьЗадачиПоБП(Отказ) Экспорт
	
	// Запустим БП если он еще не запущен
	Попытка
		Если абс_Статус = Перечисления.абс_СтатусыАктовПриемки.СогласованиеРуководителемЦФО Тогда
			БПСогласование = НайтиБПСогласование();
			
			Если Не ЗначениеЗаполнено(БПСогласование) Тогда
				//абс_БизнесПроцессы.ЗапуститьБПСогласованияПервичногоДокумента(Ссылка);	
				БП = БизнесПроцессы.абс_СогласованиеАктовПриемки.СоздатьБизнесПроцесс();
				БП.Дата = абс_СерверныеФункции.ПолучитьДатуСервера();
				БП.ПервичныйДокумент 		= Ссылка;
				БП.ПользовательИнициаторБП 	= Ответственный;

				БП.Записать();
					
				БП.Старт(БизнесПроцессы.абс_СогласованиеАктовПриемки.ТочкиМаршрута.Старт);

			КонецЕсли;
			
		КонецЕсли;
		
		Если абс_Статус = Перечисления.абс_СтатусыАктовПриемки.УточнениеБухгалтерией Тогда
			
			БПСогласование = НайтиБПСогласование();
			
			Если Не ЗначениеЗаполнено(БПСогласование) Тогда
				//абс_БизнесПроцессы.ЗапуститьБПСогласованияПервичногоДокументаУточнениеБухгалтером(Ссылка);
				БП = БизнесПроцессы.абс_СогласованиеАктовПриемки.СоздатьБизнесПроцесс();
				БП.Дата = абс_СерверныеФункции.ПолучитьДатуСервера();
				БП.ПервичныйДокумент 		= Ссылка;
				БП.ПользовательИнициаторБП 	= Ответственный;

				БП.Записать();
					
				БП.Старт(БизнесПроцессы.абс_СогласованиеАктовПриемки.ТочкиМаршрута.СтартУточнениеБухгалтером);

			КонецЕсли;
			
		КонецЕсли;
		
		// Попробуем закрыть задачу согласования
		ЗадачаСогласование = ПолучитьЗадачуПоПервичномуДокументуСогласование();
		
		Если ЗадачаСогласование = Неопределено Тогда
			Возврат;
		КонецЕсли;
				
		Если НЕ ЗадачаСогласование.Выполнена Тогда

			ЗадачаОбъект = ЗадачаСогласование.ПолучитьОбъект();			
			ЗадачаОбъект.ВыполнитьЗадачу();
		КонецЕсли;

	Исключение

		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при записи документа: " + ОписаниеОшибки() + ".", Отказ);
		
		Возврат;
	КонецПопытки;  
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	// АБС ВСТАВКА Создание на основании договора
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДоговорНаВыполнениеРаботСФизЛицом") Тогда
		Если ДанныеЗаполнения.абс_СтатусДоговора <> Перечисления.абс_СтатусыДоговоровПодряда.Исполнение Тогда
			Сообщить("Акт можно создать только на основании договора в статусе Исполнение");
			мЗаполнениеНеУспешно = Истина;
			Возврат;
		КонецЕсли;
		Если ДанныеЗаполнения.ХарактерОплаты <> Перечисления.ХарактерВыплатыПоДоговору.абс_ПоАктамВыполненныхРабот Тогда
			Сообщить("Акт можно создавать только на основании договора с характером оплаты ""По актам выполненных работ""");
			мЗаполнениеНеУспешно = Истина;
			Возврат;
		КонецЕсли;
		
		Организация = ДанныеЗаполнения.Организация;
		
		НоваяСтрока = Сотрудники.Добавить();
		НоваяСтрока.ДоговорПодряда = ДанныеЗаполнения;
		НоваяСтрока.Сотрудник = ДанныеЗаполнения.Сотрудник;
	КонецЕсли;	
	// АБС ВСТАВКА КОНЕЦ
КонецПроцедуры

//Функция НайтиБПСогласование() Экспорт
//	
//	Возврат абс_БизнесПроцессы.НайтиБизнесПроцессПоАктуПриёмки(Ссылка, "абсСогласованиеАктовПриёмки");
//	
//КонецФункции

//Функция ПолучитьЗадачуСогласование()
//	
//	БП = НайтиБПСогласование();
//	
//	Если БП = Неопределено Тогда
//		Возврат Неопределено;
//	КонецЕсли;

//	СпТочек = Новый Массив;
//	
//	ТекСтатус = Ссылка.абс_СтатусАкта;
//	
//	Если ТекСтатус = Перечисления.абсСтатусыАктовПриёмки.Подготовка Тогда
//		
//		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеАктовПриёмки.ТочкиМаршрута.ДействиеОтказ);
//		
//	ИначеЕсли ТекСтатус = Перечисления.абсСтатусыАктовПриёмки.СогласованиеРукДеп Тогда
//		
//		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеАктовПриёмки.ТочкиМаршрута.ДействиеПодготовкаАПВР);
//		
//	ИначеЕсли ТекСтатус = Перечисления.абсСтатусыАктовПриёмки.СогласованиеПВП Тогда		
//		
//		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеАктовПриёмки.ТочкиМаршрута.ДействиеСогласованиеРукДеп);

//	ИначеЕсли ТекСтатус = Перечисления.абсСтатусыАктовПриёмки.Согласован Тогда		
//		
//		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеАктовПриёмки.ТочкиМаршрута.ДействиеСогласованиеПВП);

//	ИначеЕсли ТекСтатус = Перечисления.абсСтатусыАктовПриёмки.ОбработкаБухгалтером Тогда		
//		
//		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеАктовПриёмки.ТочкиМаршрута.ДействиеСогласован);

//	ИначеЕсли ТекСтатус = Перечисления.абсСтатусыАктовПриёмки.ПринятоДляРасчёта Тогда		
//		
//		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеАктовПриёмки.ТочкиМаршрута.ДействиеОбработкаБухгалтером);

//	ИначеЕсли ТекСтатус = Перечисления.абсСтатусыАктовПриёмки.Завершён Тогда		
//		
//		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеАктовПриёмки.ТочкиМаршрута.ДействиеРасчётБухгалтером);

//	ИначеЕсли ТекСтатус = Перечисления.абсСтатусыАктовПриёмки.Отмена Тогда		
//		
//		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеАктовПриёмки.ТочкиМаршрута.ДействиеПодготовкаАПВР);

//	ИначеЕсли ТекСтатус = Перечисления.абсСтатусыАктовПриёмки.Отказ Тогда
//		
//		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеАктовПриёмки.ТочкиМаршрута.ДействиеСогласованиеРукДеп);
//		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеАктовПриёмки.ТочкиМаршрута.ДействиеСогласованиеПВП);
//		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеАктовПриёмки.ТочкиМаршрута.ДействиеОбработкаБухгалтером);
//		СпТочек.Добавить(БизнесПроцессы.абсСогласованиеАктовПриёмки.ТочкиМаршрута.ДействиеСогласован);
//		
//	КонецЕсли;
//			
//	Возврат НайтиЗадачу(БП, СпТочек,,Ложь);

//КонецФункции

//Функция НайтиЗадачу(БизнесПроцесс, ТочкаМаршрута, Исполнитель = Неопределено, ОтборПоИсполнителю = Истина)
//	
//	Если Исполнитель = Неопределено Тогда
//		Исполнитель = глЗначениеПеременной("глТекущийПользователь");
//	КонецЕсли;	
//	
//	ЗапросЗадач = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
//							   |	абсЗадачаДоговора.Ссылка
//							   |ИЗ
//							   |	Задача.абсЗадачаДоговора КАК абсЗадачаДоговора
//							   |ГДЕ
//							   |	абсЗадачаДоговора.БизнесПроцесс = &БизнесПроцесс
//							   |	И абсЗадачаДоговора.ТочкаМаршрута В(&ТочкаМаршрута)
//							   |	И ВЫБОР
//							   |			КОГДА &ОтборПоИсполнителю
//							   |				ТОГДА абсЗадачаДоговора.Исполнитель = &Исполнитель
//							   |			ИНАЧЕ ИСТИНА
//							   |		КОНЕЦ
//							   |	И абсЗадачаДоговора.Выполнена = ЛОЖЬ
//							   |
//							   |УПОРЯДОЧИТЬ ПО
//							   |	абсЗадачаДоговора.Дата УБЫВ");
//							   
//							   
//	ЗапросЗадач.УстановитьПараметр("БизнесПроцесс"		, БизнесПроцесс);
//	ЗапросЗадач.УстановитьПараметр("ТочкаМаршрута"		, ТочкаМаршрута);
//	ЗапросЗадач.УстановитьПараметр("Исполнитель"		, Исполнитель);
//	ЗапросЗадач.УстановитьПараметр("ОтборПоИсполнителю"	, ОтборПоИсполнителю);
//	
//	ВыборкаЗадач = ЗапросЗадач.Выполнить().Выбрать();
//	
//	ЗадачаСсылка = Неопределено;
//	
//	Если ВыборкаЗадач.Следующий() Тогда
//		ЗадачаСсылка = ВыборкаЗадач.Ссылка;
//	КонецЕсли;
//	
//	Возврат ЗадачаСсылка;
//	
//КонецФункции

//Процедура ВыполнитьЗадачуСогласование(ЗадачаСогласование)
//	
//	Если НЕ ЗадачаСогласование.Выполнена Тогда
//		
//		ЗадачаОбъект = ЗадачаСогласование.ПолучитьОбъект();		
//		ЗадачаОбъект.ВыполнитьЗадачу();
//		
//		Если НЕ ЗначениеЗаполнено(ЗадачаОбъект.БизнесПроцесс.АктПриёмкиВыполненныхРабот) Тогда
//			
//			БПОбъект = ЗадачаОбъект.БизнесПроцесс.ПолучитьОбъект();			
//			БПОбъект.АктПриёмкиВыполненныхРабот = Ссылка;
//			БПОбъект.Записать();
//			
//		КонецЕсли;
//	КонецЕсли;	
//	
//КонецПроцедуры

мТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
